docs/lua/tools/luaunit.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-26 日 10:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>luaunit</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="刘尚亮" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">luaunit</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org79c9d72">1. 概述</a></li>
<li><a href="#org27f5ea2">2. 安装</a></li>
<li><a href="#orge657bad">3. 使用</a></li>
<li><a href="#orgbd2d1f3">4. 命令行</a>
<ul>
<li><a href="#orgacac4ed">4.1. options</a></li>
</ul>
</li>
<li><a href="#orgd40f3b5">5. 常用断言</a>
<ul>
<li><a href="#org43fa2da">5.1. Equal assertions</a>
<ul>
<li><a href="#orgda17610">5.1.1. assertEquals</a></li>
<li><a href="#org5701ec0">5.1.2. assertNotEquals(actual, expected)</a></li>
<li><a href="#org7ac0a6b">5.1.3. assertAlmostEquals(actual, expected, margin)</a></li>
<li><a href="#orgffab395">5.1.4. assertNotAlmostEquals</a></li>
</ul>
</li>
<li><a href="#orgbb08ef5">5.2. Value assertions</a>
<ul>
<li><a href="#org45d86de">5.2.1. assertTrue</a></li>
<li><a href="#org353627c">5.2.2. assertFalse</a></li>
<li><a href="#org9868074">5.2.3. assertNil(value)</a></li>
<li><a href="#orgec5da26">5.2.4. assertNotNil(value)</a></li>
<li><a href="#org1136be6">5.2.5. assertIs(actual, expected)</a></li>
<li><a href="#orgffab8ff">5.2.6. assertNotIs(actual, expected)</a></li>
</ul>
</li>
<li><a href="#orgab2bb24">5.3. String assertions</a>
<ul>
<li><a href="#orgb7cf600">5.3.1. assertStrContains(str, sub[, useRe])</a></li>
<li><a href="#org78f9364">5.3.2. assertStrIContains(str, sub)</a></li>
<li><a href="#orga44158c">5.3.3. assertNotStrContains(str, sub, useRe)</a></li>
<li><a href="#orgbbda67c">5.3.4. assertNotStrIContains(str, sub)</a></li>
<li><a href="#org7057181">5.3.5. assertStrMatches(str, pattern[, start[, final]])</a></li>
</ul>
</li>
<li><a href="#orga29170e">5.4. Error assertions</a>
<ul>
<li><a href="#org0add1ec">5.4.1. assertError(func, &#x2026;)</a></li>
<li><a href="#org51cea0a">5.4.2. assertErrorMsgEquals(expectedMsg, func, &#x2026;)</a></li>
<li><a href="#org240d528">5.4.3. assertErrorMsgContains(partialMsg, func, &#x2026;)</a></li>
<li><a href="#org7cb0661">5.4.4. assertErrorMsgMatches(expectedPattern, func, &#x2026;)</a></li>
</ul>
</li>
<li><a href="#org2d5215f">5.5. Type assertions</a>
<ul>
<li><a href="#org8bab606">5.5.1. assertIsNumber(value)</a></li>
<li><a href="#orgcf8f8ed">5.5.2. assertIsString(value)</a></li>
<li><a href="#org64fc925">5.5.3. assertIsTable(value)</a></li>
<li><a href="#org5a07039">5.5.4. assertIsBoolean(value)</a></li>
<li><a href="#orgf58ea34">5.5.5. assertIsNil(value)</a></li>
<li><a href="#orgf61e14f">5.5.6. assertIsFunction(value)</a></li>
<li><a href="#orge229ae4">5.5.7. assertIsUserdata(value)</a></li>
<li><a href="#org3d54400">5.5.8. assertIsCoroutine(value)</a></li>
</ul>
</li>
<li><a href="#orgb000f34">5.6. Table assertions</a>
<ul>
<li><a href="#org334322f">5.6.1. assertItemsEquals(actual, expected)</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org79c9d72" class="outline-2">
<h2 id="org79c9d72"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/bluebird75/luaunit">LuaUnit</a> 是一个流行的 Lua 单元测试框架，具有典型的 xUnit 库（比如 Python 的 unittest，Junit 等）接口。它支持多种输出格式（文本，TAP，JUnit，&#x2026;）来直接使用或与持续集成平台（Jenkins，Maven，&#x2026;）一起使用。
</p>

<p>
LuaUnit 提供了丰富的断言机制，并且在输出结果上也做的不错，比如，对比 table 的时候可以输出不一致的项。
</p>
</div>
</div>

<div id="outline-container-org27f5ea2" class="outline-2">
<h2 id="org27f5ea2"><span class="section-number-2">2</span> 安装</h2>
<div class="outline-text-2" id="text-2">
<p>
建议使用 luarocks 安装：
</p>
<div class="org-src-container">
<pre class="src src-sh">luarocks install luaunit
</pre>
</div>
</div>
</div>

<div id="outline-container-orge657bad" class="outline-2">
<h2 id="orge657bad"><span class="section-number-2">3</span> 使用</h2>
<div class="outline-text-2" id="text-3">
<p>
更详细的手册内容参见<a href="https://luaunit.readthedocs.io/en/luaunit_v3_2_1/#">read-the-docs</a>。
</p>

<p>
LuaUnit 扫描所有以 <code>test</code> 或 <code>Test</code> 开头的变量。如果它们是函数，或者它们是包含以 <code>test</code> 或 <code>Test</code> 开始的函数的表，则它们作为测试套件的一部分运行（这点和 Python unittest 类似）。
</p>

<p>
由于每个函数对应的测试用例一般都大于 1 个，所以推荐使用 table 组织一个函数的所有测试用例。
</p>

<p>
注意这些变量要放在全局空间（_G），不能是 local 函数。
</p>

<p>
当在表中定义测试时，您可以选择定义两个特殊函数 <code>setUp</code> 和 <code>tearDown</code> ， 它们将分别在每次测试之前和之后执行。这些函数可用于为正在执行的测试创建特定资源并清理测试环境。
</p>
</div>
</div>

<div id="outline-container-orgbd2d1f3" class="outline-2">
<h2 id="orgbd2d1f3"><span class="section-number-2">4</span> 命令行</h2>
<div class="outline-text-2" id="text-4">
<p>
命令行选项提供了一个灵活的界面，可以按名称或模式选择测试，控制输出格式，设置详细程度等。
</p>

<div class="org-src-container">
<pre class="src src-sh">lua &lt;your_test_suite.lua&gt; [options] [testname1] [testname2]
</pre>
</div>

<p>
testname 可以是 testcase，testsuit 或者 testsuit 中具体方法。
</p>
</div>

<div id="outline-container-orgacac4ed" class="outline-3">
<h3 id="orgacac4ed"><span class="section-number-3">4.1</span> options</h3>
<div class="outline-text-3" id="text-4-1">
<p>
常用选项：
</p>
<ul class="org-ul">
<li><code>-h</code> 显示帮助信息。</li>
<li><code>-o</code> 指定输出格式，可以是 text（默认），nil，TAP，junit。</li>
<li><code>-v</code> 显示详细的输出信息。</li>
<li><code>-p</code> 参数匹配 testsuit 和 testcase 的名字，来指定运行示例。</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgd40f3b5" class="outline-2">
<h2 id="orgd40f3b5"><span class="section-number-2">5</span> 常用断言</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org43fa2da" class="outline-3">
<h3 id="org43fa2da"><span class="section-number-3">5.1</span> Equal assertions</h3>
<div class="outline-text-3" id="text-5-1">
<p>
所有相等断言函数都采用两个参数，按实际值和期望值的顺序。即 assert(actual,expect)。
</p>
</div>
<div id="outline-container-orgda17610" class="outline-4">
<h4 id="orgda17610"><span class="section-number-4">5.1.1</span> assertEquals</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
断言两个值相等。
</p>

<p>
对于表格，比较是一个深度的比较：
</p>
<ul class="org-ul">
<li>元素数量必须相同。</li>
<li>表必须包含相同的键</li>
<li>每个键必须包含相同的值。 还通过深度比较递归地比较这些值。</li>
</ul>

<p>
LuaUnit 提供了其他与表相关的断言，请参阅表断言。
</p>
</div>
</div>

<div id="outline-container-org5701ec0" class="outline-4">
<h4 id="org5701ec0"><span class="section-number-4">5.1.2</span> assertNotEquals(actual, expected)</h4>
</div>

<div id="outline-container-org7ac0a6b" class="outline-4">
<h4 id="org7ac0a6b"><span class="section-number-4">5.1.3</span> assertAlmostEquals(actual, expected, margin)</h4>
<div class="outline-text-4" id="text-5-1-3">
<p>
断言两个浮点数几乎相等。
</p>

<p>
比较浮点数时，严格相等不起作用。 计算机算术使得数学上产生 1.00000000 的操作在 lua 中可能产生 0.999999999999。 这就是为什么你需要一个几乎相等的比较，你指定误差范围。
</p>
</div>
</div>

<div id="outline-container-orgffab395" class="outline-4">
<h4 id="orgffab395"><span class="section-number-4">5.1.4</span> assertNotAlmostEquals</h4>
</div>
</div>

<div id="outline-container-orgbb08ef5" class="outline-3">
<h3 id="orgbb08ef5"><span class="section-number-3">5.2</span> Value assertions</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-org45d86de" class="outline-4">
<h4 id="org45d86de"><span class="section-number-4">5.2.1</span> assertTrue</h4>
</div>

<div id="outline-container-org353627c" class="outline-4">
<h4 id="org353627c"><span class="section-number-4">5.2.2</span> assertFalse</h4>
</div>

<div id="outline-container-org9868074" class="outline-4">
<h4 id="org9868074"><span class="section-number-4">5.2.3</span> assertNil(value)</h4>
</div>

<div id="outline-container-orgec5da26" class="outline-4">
<h4 id="orgec5da26"><span class="section-number-4">5.2.4</span> assertNotNil(value)</h4>
</div>

<div id="outline-container-org1136be6" class="outline-4">
<h4 id="org1136be6"><span class="section-number-4">5.2.5</span> assertIs(actual, expected)</h4>
<div class="outline-text-4" id="text-5-2-5">
<p>
断言两个变量是相同的。对于 string，numbers，boolean 和 nil，这给出了与 assertEquals（）相同的结果。对于其他类型，identity 表示两个变量引用同一个对象。
</p>
</div>
</div>

<div id="outline-container-orgffab8ff" class="outline-4">
<h4 id="orgffab8ff"><span class="section-number-4">5.2.6</span> assertNotIs(actual, expected)</h4>
</div>
</div>

<div id="outline-container-orgab2bb24" class="outline-3">
<h3 id="orgab2bb24"><span class="section-number-3">5.3</span> String assertions</h3>
<div class="outline-text-3" id="text-5-3">
</div>
<div id="outline-container-orgb7cf600" class="outline-4">
<h4 id="orgb7cf600"><span class="section-number-4">5.3.1</span> assertStrContains(str, sub[, useRe])</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
默认情况下，在字符串中搜索子字符串。如果提供了 useRe 并且为 true，则将 sub 视为在字符串 str 内搜索的模式。
</p>
</div>
</div>

<div id="outline-container-org78f9364" class="outline-4">
<h4 id="org78f9364"><span class="section-number-4">5.3.2</span> assertStrIContains(str, sub)</h4>
<div class="outline-text-4" id="text-5-3-2">
<p>
忽略大小查找，与 assertStrcontains()不同，它不使用模式查找。
</p>
</div>
</div>

<div id="outline-container-orga44158c" class="outline-4">
<h4 id="orga44158c"><span class="section-number-4">5.3.3</span> assertNotStrContains(str, sub, useRe)</h4>
</div>

<div id="outline-container-orgbbda67c" class="outline-4">
<h4 id="orgbbda67c"><span class="section-number-4">5.3.4</span> assertNotStrIContains(str, sub)</h4>
</div>

<div id="outline-container-org7057181" class="outline-4">
<h4 id="org7057181"><span class="section-number-4">5.3.5</span> assertStrMatches(str, pattern[, start[, final]])</h4>
<div class="outline-text-4" id="text-5-3-5">
<p>
断言字符串匹配完整的模式。
</p>
</div>
</div>
</div>

<div id="outline-container-orga29170e" class="outline-3">
<h3 id="orga29170e"><span class="section-number-3">5.4</span> Error assertions</h3>
<div class="outline-text-3" id="text-5-4">
</div>
<div id="outline-container-org0add1ec" class="outline-4">
<h4 id="org0add1ec"><span class="section-number-4">5.4.1</span> assertError(func, &#x2026;)</h4>
<div class="outline-text-4" id="text-5-4-1">
<p>
断言用参数调用函数 func 会产生错误。如果函数没有产生错误，则断言失败。
</p>
</div>
</div>

<div id="outline-container-org51cea0a" class="outline-4">
<h4 id="org51cea0a"><span class="section-number-4">5.4.2</span> assertErrorMsgEquals(expectedMsg, func, &#x2026;)</h4>
</div>

<div id="outline-container-org240d528" class="outline-4">
<h4 id="org240d528"><span class="section-number-4">5.4.3</span> assertErrorMsgContains(partialMsg, func, &#x2026;)</h4>
</div>

<div id="outline-container-org7cb0661" class="outline-4">
<h4 id="org7cb0661"><span class="section-number-4">5.4.4</span> assertErrorMsgMatches(expectedPattern, func, &#x2026;)</h4>
</div>
</div>

<div id="outline-container-org2d5215f" class="outline-3">
<h3 id="org2d5215f"><span class="section-number-3">5.5</span> Type assertions</h3>
<div class="outline-text-3" id="text-5-5">
</div>
<div id="outline-container-org8bab606" class="outline-4">
<h4 id="org8bab606"><span class="section-number-4">5.5.1</span> assertIsNumber(value)</h4>
</div>

<div id="outline-container-orgcf8f8ed" class="outline-4">
<h4 id="orgcf8f8ed"><span class="section-number-4">5.5.2</span> assertIsString(value)</h4>
</div>

<div id="outline-container-org64fc925" class="outline-4">
<h4 id="org64fc925"><span class="section-number-4">5.5.3</span> assertIsTable(value)</h4>
</div>

<div id="outline-container-org5a07039" class="outline-4">
<h4 id="org5a07039"><span class="section-number-4">5.5.4</span> assertIsBoolean(value)</h4>
</div>

<div id="outline-container-orgf58ea34" class="outline-4">
<h4 id="orgf58ea34"><span class="section-number-4">5.5.5</span> assertIsNil(value)</h4>
</div>

<div id="outline-container-orgf61e14f" class="outline-4">
<h4 id="orgf61e14f"><span class="section-number-4">5.5.6</span> assertIsFunction(value)</h4>
</div>

<div id="outline-container-orge229ae4" class="outline-4">
<h4 id="orge229ae4"><span class="section-number-4">5.5.7</span> assertIsUserdata(value)</h4>
</div>

<div id="outline-container-org3d54400" class="outline-4">
<h4 id="org3d54400"><span class="section-number-4">5.5.8</span> assertIsCoroutine(value)</h4>
</div>
</div>

<div id="outline-container-orgb000f34" class="outline-3">
<h3 id="orgb000f34"><span class="section-number-3">5.6</span> Table assertions</h3>
<div class="outline-text-3" id="text-5-6">
</div>
<div id="outline-container-org334322f" class="outline-4">
<h4 id="org334322f"><span class="section-number-4">5.6.1</span> assertItemsEquals(actual, expected)</h4>
<div class="outline-text-4" id="text-5-6-1">
<p>
断言两个表包含相同的项，而不管它们的键。 例如，如果要比较两个列表但项目的顺序不同，则此功能很实用。
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 刘尚亮</p>
<p class="email">Email: <a href="mailto:phenix3443@gmail.com">phenix3443@gmail.com</a></p>
<p class="date">Created: 2020-04-26 日 10:54</p>
<p class="validation"></p>
</div>
</body>
</html>
